### Deploy Env ☁️ `dev`

#### Terraform Format and Style 🖌`✅`
#### Terraform Initialization ⚙️`✅`
#### Terraform Validation 🤖`✅`

<details><summary>Validation Output</summary>

  ```
  Success! The configuration is valid.


  ```

</details>

#### Terraform Plan 📖`✅`

<details><summary>Show Plan</summary>

  ```terraform
  module.ecs.data.aws_iam_policy.ecs_managed_role_policy: Reading...
module.s3_bucket_dev.aws_s3_bucket_public_access_block.example: Refreshing state... [id=tek-tag-generator-dev]
module.ecs.data.aws_iam_policy_document.inline_policy_doc: Reading...
module.ecs.aws_eip.elasticips["pub2"]: Refreshing state... [id=eipalloc-0e9ffd853090376d0]
module.ecs.aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:eu-west-3:637423196893:cluster/taggenerator-cluster-dev]
module.ecs.data.aws_iam_policy_document.assume_role: Reading...
module.ecs.aws_vpc.tag_gen_vpc: Refreshing state... [id=vpc-0afb003a4285e005b]
module.s3_bucket_dev.aws_s3_bucket.example: Refreshing state... [id=tek-tag-generator-dev]
module.ecs.aws_eip.elasticips["pub1"]: Refreshing state... [id=eipalloc-0553d46b53831291f]
module.ecs.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=1077804475]
module.ecs.data.aws_iam_policy_document.inline_policy_doc: Read complete after 0s [id=3977984228]
module.ecs.aws_iam_role.this: Refreshing state... [id=ECSTaskExecutionRole]
module.ecs.aws_iam_role.api_task: Refreshing state... [id=TaggeneratorApiECSTaskRole]
module.ecs.aws_iam_policy.inline_policy: Refreshing state... [id=arn:aws:iam::637423196893:policy/ECSTaskS3RoleInlinePolicy]
module.ecs.data.aws_iam_policy.ecs_managed_role_policy: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.ecs.aws_iam_role_policy_attachment.this: Refreshing state... [id=ECSTaskExecutionRole-20240821120021895800000003]
module.ecs.aws_ecs_task_definition.ui_task: Refreshing state... [id=taggenerator-ui-task-dev]
module.ecs.aws_iam_role_policy_attachment.that: Refreshing state... [id=TaggeneratorApiECSTaskRole-20240821120021803400000002]
module.ecs.aws_ecs_task_definition.api_task: Refreshing state... [id=taggenerator-api-task-dev]
module.ecs.aws_internet_gateway.ig: Refreshing state... [id=igw-09b9629e7e7976ca0]
module.ecs.aws_service_discovery_private_dns_namespace.this: Refreshing state... [id=ns-kqie7d2lb4wjsspn]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:637423196893:targetgroup/UI-target-group-dev/96721125ca38cd81]
module.ecs.aws_lb.lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:637423196893:loadbalancer/app/load-balancer-dev/ada8db57b66e78be]
module.s3_bucket_dev.aws_s3_bucket_ownership_controls.example: Refreshing state... [id=tek-tag-generator-dev]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:637423196893:listener/app/load-balancer-dev/ada8db57b66e78be/d474a03facf12256]
module.ecs.aws_ecs_service.api: Refreshing state... [id=arn:aws:ecs:eu-west-3:637423196893:service/taggenerator-cluster-dev/taggenerator-api-service-dev]
module.ecs.aws_ecs_service.ui: Refreshing state... [id=arn:aws:ecs:eu-west-3:637423196893:service/taggenerator-cluster-dev/taggenerator-ui-service-dev]
module.s3_bucket_dev.aws_s3_bucket_acl.example: Refreshing state... [id=tek-tag-generator-dev,private]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ecs.aws_ecs_cluster.ecs_cluster has been deleted
  - resource "aws_ecs_cluster" "ecs_cluster" {
      - id       = "arn:aws:ecs:eu-west-3:637423196893:cluster/taggenerator-cluster-dev" -> null
        name     = "taggenerator-cluster-dev"
        tags     = {}
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_internet_gateway.ig has been deleted
  - resource "aws_internet_gateway" "ig" {
      - id       = "igw-09b9629e7e7976ca0" -> null
        tags     = {
            "Name" = "TagGen IG"
        }
        # (4 unchanged attributes hidden)
    }

  # module.ecs.aws_lb.lb has been deleted
  - resource "aws_lb" "lb" {
      - arn                                         = "arn:aws:elasticloadbalancing:eu-west-3:637423196893:loadbalancer/app/load-balancer-dev/ada8db57b66e78be" -> null
        id                                          = "arn:aws:elasticloadbalancing:eu-west-3:637423196893:loadbalancer/app/load-balancer-dev/ada8db57b66e78be"
        name                                        = "load-balancer-dev"
        tags                                        = {}
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_lb_target_group.target_group has been deleted
  - resource "aws_lb_target_group" "target_group" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-west-3:637423196893:targetgroup/UI-target-group-dev/96721125ca38cd81" -> null
        id                                 = "arn:aws:elasticloadbalancing:eu-west-3:637423196893:targetgroup/UI-target-group-dev/96721125ca38cd81"
        name                               = "UI-target-group-dev"
        tags                               = {}
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "taggenerator-cluster-dev"
      + tags_all = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
    }

  # module.ecs.aws_ecs_service.api will be created
  + resource "aws_ecs_service" "api" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "taggenerator-api-service-dev"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + task_definition                    = "arn:aws:ecs:eu-west-3:637423196893:task-definition/taggenerator-api-task-dev:8"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = (known after apply)

          + service {
              + discovery_name = "dev-api-service"
              + port_name      = "taggenerator-api-dev"

              + client_alias {
                  + dns_name = "dev-api"
                  + port     = 8080
                }
            }
        }
    }

  # module.ecs.aws_ecs_service.ui will be created
  + resource "aws_ecs_service" "ui" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "taggenerator-ui-service-dev"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + task_definition                    = "arn:aws:ecs:eu-west-3:637423196893:task-definition/taggenerator-ui-task-dev:5"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "taggenerator-ui-container"
          + container_port   = 8501
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = (known after apply)
        }
    }

  # module.ecs.aws_internet_gateway.ig will be created
  + resource "aws_internet_gateway" "ig" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "TagGen IG"
        }
      + tags_all = {
          + "Name"            = "TagGen IG"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id   = (known after apply)
    }

  # module.ecs.aws_lb.lb will be created
  + resource "aws_lb" "lb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "load-balancer-dev"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags_all                                                     = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.ecs.aws_lb_listener.listener will be created
  + resource "aws_lb_listener" "listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.ecs.aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "UI-target-group-dev"
      + name_prefix                        = (known after apply)
      + port                               = 8501
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)
    }

  # module.ecs.aws_nat_gateway.nats["pub1"] will be created
  + resource "aws_nat_gateway" "nats" {
      + allocation_id                      = "eipalloc-0553d46b53831291f"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "NatGateway for Public Subnet 1"
        }
      + tags_all                           = {
          + "Name"            = "NatGateway for Public Subnet 1"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
    }

  # module.ecs.aws_nat_gateway.nats["pub2"] will be created
  + resource "aws_nat_gateway" "nats" {
      + allocation_id                      = "eipalloc-0e9ffd853090376d0"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "NatGateway for Public Subnet 2"
        }
      + tags_all                           = {
          + "Name"            = "NatGateway for Public Subnet 2"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
    }

  # module.ecs.aws_route_table.privates["priv1"] will be created
  + resource "aws_route_table" "privates" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/20"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "local"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "Private Route Table priv1"
        }
      + tags_all         = {
          + "Name"            = "Private Route Table priv1"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id           = (known after apply)
    }

  # module.ecs.aws_route_table.privates["priv2"] will be created
  + resource "aws_route_table" "privates" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/20"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "local"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "Private Route Table priv2"
        }
      + tags_all         = {
          + "Name"            = "Private Route Table priv2"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id           = (known after apply)
    }

  # module.ecs.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/20"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "local"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "Public Route"
        }
      + tags_all         = {
          + "Name"            = "Public Route"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id           = (known after apply)
    }

  # module.ecs.aws_route_table_association.privates["priv1"] will be created
  + resource "aws_route_table_association" "privates" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.ecs.aws_route_table_association.privates["priv2"] will be created
  + resource "aws_route_table_association" "privates" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.ecs.aws_route_table_association.publics["pub1"] will be created
  + resource "aws_route_table_association" "publics" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.ecs.aws_route_table_association.publics["pub2"] will be created
  + resource "aws_route_table_association" "publics" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.ecs.aws_security_group.ecs_api_sg will be created
  + resource "aws_security_group" "ecs_api_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "rule for inbound API call"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "ecs-api-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_security_group.ecs_ui_sg will be created
  + resource "aws_security_group" "ecs_ui_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Permit all outgoing requests to the internet"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "rule for inbound UI call"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "ecs-ui-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_security_group.lb_security_group will be created
  + resource "aws_security_group" "lb_security_group" {
      + arn                    = (known after apply)
      + description            = "security group for the load_balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Permit all outgoing requests to the internet"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Permit incoming HTTP requests from the internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "lb-sg-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_service_discovery_private_dns_namespace.this must be replaced
-/+ resource "aws_service_discovery_private_dns_namespace" "this" {
      ~ arn         = "arn:aws:servicediscovery:eu-west-3:637423196893:namespace/ns-kqie7d2lb4wjsspn" -> (known after apply)
      ~ hosted_zone = "Z0946400ZPVI41Y0Y0YL" -> (known after apply)
      ~ id          = "ns-kqie7d2lb4wjsspn" -> (known after apply)
        name        = "taggenerator.dev"
      - tags        = {} -> null
      ~ vpc         = "vpc-0afb003a4285e005b" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_subnet.privates["priv1"] will be created
  + resource "aws_subnet" "privates" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/23"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private Subnet 1"
        }
      + tags_all                                       = {
          + "Name"            = "Private Subnet 1"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.ecs.aws_subnet.privates["priv2"] will be created
  + resource "aws_subnet" "privates" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/23"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private Subnet 2"
        }
      + tags_all                                       = {
          + "Name"            = "Private Subnet 2"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.ecs.aws_subnet.publics["pub1"] will be created
  + resource "aws_subnet" "publics" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public Subnet 1"
        }
      + tags_all                                       = {
          + "Name"            = "Public Subnet 1"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.ecs.aws_subnet.publics["pub2"] will be created
  + resource "aws_subnet" "publics" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public Subnet 2"
        }
      + tags_all                                       = {
          + "Name"            = "Public Subnet 2"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.ecs.aws_vpc.tag_gen_vpc must be replaced
-/+ resource "aws_vpc" "tag_gen_vpc" {
      ~ arn                                  = "arn:aws:ec2:eu-west-3:637423196893:vpc/vpc-0afb003a4285e005b" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.0.0.0/16" -> "10.0.0.0/20" # forces replacement
      ~ default_network_acl_id               = "acl-0e8f6b4df28e1fc04" -> (known after apply)
      ~ default_route_table_id               = "rtb-08a75f97a80ea884a" -> (known after apply)
      ~ default_security_group_id            = "sg-08282656aa7e5a931" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-092a153bc04514006" -> (known after apply)
      ~ enable_dns_hostnames                 = false -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-0afb003a4285e005b" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-08a75f97a80ea884a" -> (known after apply)
      ~ owner_id                             = "637423196893" -> (known after apply)
      ~ tags                                 = {
          + "Name" = "TagGen VPC"
        }
      ~ tags_all                             = {
          + "Name"            = "TagGen VPC"
            # (5 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

Plan: 25 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

  ```

</details>

*Pushed by: @tekeinhor, Action: `pull_request`*